tools/k6/results/on_2.txt


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=321.9ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1483    24.589933/s
    checks_succeeded...: 100.00% 1483 out of 1483
    checks_failed......: 0.00%   0 out of 1483

    ✓ status 200

    HTTP
    http_req_duration..............: avg=95.64ms  p(50)=63.9ms   p(90)=221.6ms  p(95)=321.9ms  p(99)=578.1ms  max=1.2s 
      { expected_response:true }...: avg=95.64ms  p(50)=63.9ms   p(90)=221.6ms  p(95)=321.9ms  p(99)=578.1ms  max=1.2s 
    http_req_failed................: 0.00%  0 out of 1483
    http_reqs......................: 1483   24.589933/s

    EXECUTION
    iteration_duration.............: avg=405.52ms p(50)=377.63ms p(90)=585.88ms p(95)=690.79ms p(99)=910.29ms max=1.57s
    iterations.....................: 1483   24.589933/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 1.2 MB 20 kB/s
    data_sent......................: 141 kB 2.3 kB/s